node {
  name: "image_arrays"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 640
        }
        dim {
          size: 640
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "truediv"
  op: "RealDiv"
  input: "image_arrays"
  input: "Const_4"
}
node {
  name: "efficientnet-b1/stem/conv2d/Conv2D"
  op: "Conv2D"
  input: "truediv"
  input: "efficientnet-b1/stem/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/stem/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/stem/conv2d/Conv2D"
  input: "efficientnet-b1/stem/tpu_batch_normalization/gamma"
  input: "efficientnet-b1/stem/tpu_batch_normalization/beta"
  input: "efficientnet-b1/stem/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b1/stem/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/stem/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/stem/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/stem/mul"
  op: "Mul"
  input: "efficientnet-b1/stem/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b1/stem/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_0/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b1/stem/mul"
  input: "efficientnet-b1/blocks_0/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_0/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_0/depthwise_conv2d/depthwise"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization/gamma"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization/beta"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_0/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_0/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_0/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_0/se/Mean"
  op: "Mean"
  input: "efficientnet-b1/blocks_0/mul"
  input: "efficientnet-b1/blocks_0/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b1/blocks_0/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_0/se/Mean"
  input: "efficientnet-b1/blocks_0/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_0/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_0/se/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_0/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_0/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_0/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_0/se/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_0/se/conv2d/BiasAdd"
  input: "efficientnet-b1/blocks_0/se/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_0/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_0/se/mul"
  input: "efficientnet-b1/blocks_0/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_0/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_0/se/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_0/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_0/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_0/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_0/se/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_0/mul"
  input: "efficientnet-b1/blocks_0/se/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_0/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_0/se/mul_1"
  input: "efficientnet-b1/blocks_0/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_0/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization_1/beta"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_1/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_1/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_1/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_1/depthwise_conv2d/depthwise"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization/gamma"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization/beta"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_1/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_1/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_1/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_1/se/Mean"
  op: "Mean"
  input: "efficientnet-b1/blocks_1/mul"
  input: "efficientnet-b1/blocks_1/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b1/blocks_1/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_1/se/Mean"
  input: "efficientnet-b1/blocks_1/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_1/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_1/se/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_1/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_1/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_1/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_1/se/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_1/se/conv2d/BiasAdd"
  input: "efficientnet-b1/blocks_1/se/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_1/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_1/se/mul"
  input: "efficientnet-b1/blocks_1/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_1/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_1/se/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_1/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_1/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_1/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_1/se/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_1/mul"
  input: "efficientnet-b1/blocks_1/se/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_1/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_1/se/mul_1"
  input: "efficientnet-b1/blocks_1/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_1/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization_1/beta"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_1/Add"
  op: "Add"
  input: "efficientnet-b1/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_2/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_1/Add"
  input: "efficientnet-b1/blocks_2/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_2/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_2/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization/gamma"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization/beta"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_2/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_2/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_2/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_2/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b1/blocks_2/mul"
  input: "efficientnet-b1/blocks_2/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_2/depthwise_conv2d/depthwise"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_1/beta"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_2/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_2/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_2/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_2/se/Mean"
  op: "Mean"
  input: "efficientnet-b1/blocks_2/mul_1"
  input: "efficientnet-b1/blocks_2/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b1/blocks_2/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_2/se/Mean"
  input: "efficientnet-b1/blocks_2/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_2/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_2/se/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_2/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_2/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_2/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_2/se/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_2/se/conv2d/BiasAdd"
  input: "efficientnet-b1/blocks_2/se/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_2/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_2/se/mul"
  input: "efficientnet-b1/blocks_2/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_2/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_2/se/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_2/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_2/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_2/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_2/se/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_2/mul_1"
  input: "efficientnet-b1/blocks_2/se/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_2/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_2/se/mul_1"
  input: "efficientnet-b1/blocks_2/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_2/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_2/gamma"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_2/beta"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_2/moving_mean"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_2/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_3/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_3/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization/gamma"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization/beta"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_3/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_3/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_3/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b1/blocks_3/mul"
  input: "efficientnet-b1/blocks_3/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_3/depthwise_conv2d/depthwise"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_1/beta"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_3/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_3/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_3/se/Mean"
  op: "Mean"
  input: "efficientnet-b1/blocks_3/mul_1"
  input: "efficientnet-b1/blocks_3/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_3/se/Mean"
  input: "efficientnet-b1/blocks_3/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_3/se/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_3/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_3/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_3/se/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_3/se/conv2d/BiasAdd"
  input: "efficientnet-b1/blocks_3/se/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_3/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_3/se/mul"
  input: "efficientnet-b1/blocks_3/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_3/se/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_3/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_3/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_3/se/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_3/mul_1"
  input: "efficientnet-b1/blocks_3/se/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_3/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_3/se/mul_1"
  input: "efficientnet-b1/blocks_3/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_3/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_2/gamma"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_2/beta"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_2/moving_mean"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_2/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_3/Add"
  op: "Add"
  input: "efficientnet-b1/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_4/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_3/Add"
  input: "efficientnet-b1/blocks_4/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_4/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization/gamma"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization/beta"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_4/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_4/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_4/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b1/blocks_4/mul"
  input: "efficientnet-b1/blocks_4/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_4/depthwise_conv2d/depthwise"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_1/beta"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_4/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_4/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_4/se/Mean"
  op: "Mean"
  input: "efficientnet-b1/blocks_4/mul_1"
  input: "efficientnet-b1/blocks_4/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_4/se/Mean"
  input: "efficientnet-b1/blocks_4/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_4/se/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_4/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_4/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_4/se/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_4/se/conv2d/BiasAdd"
  input: "efficientnet-b1/blocks_4/se/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_4/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_4/se/mul"
  input: "efficientnet-b1/blocks_4/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_4/se/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_4/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_4/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_4/se/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_4/mul_1"
  input: "efficientnet-b1/blocks_4/se/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_4/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_4/se/mul_1"
  input: "efficientnet-b1/blocks_4/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/tpu_batch_normalization_2/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_4/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_2/gamma"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_2/beta"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_2/moving_mean"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_2/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_4/Add"
  op: "Add"
  input: "efficientnet-b1/blocks_4/tpu_batch_normalization_2/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_3/Add"
}
node {
  name: "efficientnet-b1/blocks_5/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_4/Add"
  input: "efficientnet-b1/blocks_5/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_5/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_5/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization/gamma"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization/beta"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_5/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_5/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_5/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_5/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b1/blocks_5/mul"
  input: "efficientnet-b1/blocks_5/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_5/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_5/depthwise_conv2d/depthwise"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_1/beta"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_5/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_5/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_5/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_5/se/Mean"
  op: "Mean"
  input: "efficientnet-b1/blocks_5/mul_1"
  input: "efficientnet-b1/blocks_5/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b1/blocks_5/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_5/se/Mean"
  input: "efficientnet-b1/blocks_5/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_5/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_5/se/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_5/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_5/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_5/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_5/se/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_5/se/conv2d/BiasAdd"
  input: "efficientnet-b1/blocks_5/se/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_5/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_5/se/mul"
  input: "efficientnet-b1/blocks_5/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_5/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_5/se/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_5/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_5/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_5/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_5/se/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_5/mul_1"
  input: "efficientnet-b1/blocks_5/se/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_5/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_5/se/mul_1"
  input: "efficientnet-b1/blocks_5/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_5/tpu_batch_normalization_2/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_5/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_2/gamma"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_2/beta"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_2/moving_mean"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_2/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_2/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_6/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_6/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization/gamma"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization/beta"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_6/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_6/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_6/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b1/blocks_6/mul"
  input: "efficientnet-b1/blocks_6/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_6/depthwise_conv2d/depthwise"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_1/beta"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_6/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_6/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_6/se/Mean"
  op: "Mean"
  input: "efficientnet-b1/blocks_6/mul_1"
  input: "efficientnet-b1/blocks_6/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_6/se/Mean"
  input: "efficientnet-b1/blocks_6/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_6/se/conv2d/Conv2D"
  input: "efficientnet-b1/blocks_6/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_6/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_6/se/mul"
  op: "Mul"
  input: "efficientnet-b1/blocks_6/se/conv2d/BiasAdd"
  input: "efficientnet-b1/blocks_6/se/Sigmoid"
}
node {
  name: "efficientnet-b1/blocks_6/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_6/se/mul"
  input: "efficientnet-b1/blocks_6/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b1/blocks_6/se/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_6/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b1/blocks_6/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b1/blocks_6/se/mul_1"
  op: "Mul"
  input: "efficientnet-b1/blocks_6/mul_1"
  input: "efficientnet-b1/blocks_6/se/Sigmoid_1"
}
node {
  name: "efficientnet-b1/blocks_6/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_6/se/mul_1"
  input: "efficientnet-b1/blocks_6/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/tpu_batch_normalization_2/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b1/blocks_6/conv2d_1/Conv2D"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_2/gamma"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_2/beta"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_2/moving_mean"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_2/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b1/blocks_6/Add"
  op: "Add"
  input: "efficientnet-b1/blocks_6/tpu_batch_normalization_2/FusedBatchNormV3"
  input: "efficientnet-b1/blocks_5/tpu_batch_normalization_2/FusedBatchNormV3"
}
node {
  name: "efficientnet-b1/blocks_7/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b1/blocks_6/Add"
  input: "efficientnet-b1/blocks_7/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
